import Btn2 from '../Task2/Btn2';
import '../Task2/btn2.scss';
import './btns.scss';

export default function Task3() {
    return (
        <div className="wrapper">
            <Btn2 label={"+10"} props = {0} />
            <Btn2 label={"-100"} props = {0} />
            <Btn2 label={"+25"} props = {0}/>
        </div>
    );
}

/*Модифікуйте третє завдання:

- Додайте три додаткові кнопки. 
Після натискання на певну кнопку, значення лічильника
має змінюватися величину, характерну саме для цієї кнопки. 
Наприклад: при натисканні на першу кнопку значення збільшується на 10, 
при натисканні на другу кнопку значення зменшується на 100, 
при натисканні на третю кнопку значення збільшується на 25 і т. д.
- На кожній кнопці має бути вказана величина збільшення.
Наприклад: +10, -100, +25 і т. д.
- Величина збільшення для кожної кнопки має бути задана через механізм props.
- Використовуйте механізм функціональних компонентів, хуків, props, propTypes, стан.*/